#include "TxtScript.h"
using namespace ctt;

static map<string, vector<sScript>> s_scriptMap = 
{
	{ "AL仙岛引路使", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我可以送你去#Y蓬莱仙岛#Y,要去吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "蓬莱仙岛" }, { 9, "" }, { 37, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "AL服装店老板", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我这里出售30级装备,需要吗" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 23, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "AL杂货店老板", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我这里出售杂货,需要吗" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 60, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "AL武器店老板", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我这里出售30级武器,需要吗" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 3, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "AL药店老板", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我这里出售一级药材" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 40, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "AL驿站老板1", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我可以送你去#Y东海湾#Y,要去吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "东海湾" }, { 65, "" }, { 20, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "AL驿站老板2", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我可以送你去长安,要去吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "长安城" }, { 355, "" }, { 78, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "BJ传送女娲", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我可以送你去女娲神迹,要去吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "女娲神迹" }, { 49, "" }, { 38, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "BJ北俱芦洲土地", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我可以送你去花果山,要去吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "花果山" }, { 30, "" }, { 99, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "BJ地遁鬼", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我可以送你去长寿郊外,要去吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "长寿郊外" }, { 60, "" }, { 67, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "BJ驿站老板", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我可以送你去长安城,要去吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "长安城" }, { 363, "" }, { 82, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "BX法宝店老板", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "法宝放在背包里即可生效" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 96, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "BX药店老板", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我这里出售二级药材" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 41, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "BX花店老板", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我这里出售花儿" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 64, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },

	{ "CA乐器店老板", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我这里出售乐器,需要吗" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 84, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "CA商会总管", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 4, // 四选择 谁~ 描述~ 选项1 ~ 选项2 ~ 选项3 ~ 选项4 ~
			{ { 0, "商会总管" }, { 0, "请选择要买什么" }, { 0, "三级药品" }, { 0, "三级药品" }, { 0, "三级药品" }, { 0, "三级药品" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 42, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 42, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 2, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 42, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 3, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 42, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "CA圣山传送人", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我可以送你去战神山,要去吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "战神山" }, { 116, "" }, { 49, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "CA天台黑心商人", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我这里天价收一切#32,卖吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1004, "" }, { 2, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "CA宝石商人", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我这里出售各种宝石,需要吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 85, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "CA家园管家", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "大人要进屋吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1009, "" }, { 0, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "CA帮派竞赛主持人", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "要参加帮派竞赛吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "帮派竞赛" }, { 20, "" }, { 86, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "CA帮派竞赛主持人2", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "要离开帮派竞赛吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "长安城" }, { 370, "" }, { 113, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "CA店小二", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我这里有关于藏宝图的小道消息" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 30, "" }, { 0, "" } } },
			{ 40, // 关闭
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 7, // break
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "CA服装店伙计", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我这里出售10级装备,需要吗" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 21, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "CA服装店老板", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我这里出售20级装备,需要吗" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 22, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "CA杂货店老板", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我这里出售杂货,需要吗" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 60, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "CA李将军", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "边关正在打仗,我方的军需官碰到了麻烦,你能帮忙把物资运回来吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 60, "" }, { 0, "" } } },
			{ 40, // 关闭
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 7, // break
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "CA武器店掌柜", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我这里出售20级武器,需要吗" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 2, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "CA武器店老板", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我这里出售50级武器,需要吗" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 5, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "CA英雄大会主持人", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "要参加英雄大会吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "英雄大会" }, { 27, "" }, { 21, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "CA英雄大会主持人2", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "要离开英雄大会吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "长安城" }, { 116, "" }, { 105, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "CA福寿店老板", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我这里出售杂物,需要吗" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 93, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "CA罗道人", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我这里出售飞行符,需要吗" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 83, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "CA老矿工", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我这里出售符石,需要吗" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 97, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "CA药店老板", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我这里出售一级药材" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 40, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	// 袁天罡
	{ "CA郑镖头", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我兄长当了大将军, 镖局受到了关照，没那么缺人手了，还能做起了阵书的买卖" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 87, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "CA轿夫", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "要做轿子回家吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "我的庭院" }, { 18, "" }, { 9, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "CA郑镖头", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 15, "" }, { 0, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "CA配色师", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 4, // 四选择 谁~ 描述~ 选项1 ~ 选项2 ~ 选项3 ~ 选项4 ~
			{ { 0, "配色师" }, { 0, "请选择要对什么染色" }, { 0, "角色" }, { 0, "坐骑" }, { 0, "坐骑装饰" }, { 0, "召唤兽" } } },
			{ 6, // case ~
			{ { 5, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 8, // default
			{} },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1001, "" }, { 0, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "CA酒楼老板", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "休息一次需要#R500#R两,需要吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1006, "" }, { 0, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "CA镶嵌宝石", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "宝石镶嵌/特技回炉" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1004, "" }, { 2, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "CA门派传送人", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1008, "" }, { 0, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "CA饰品店老板", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我这里出售坐骑装饰,需要吗" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 99, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "CA驿站老板", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我可以送你去酆都,要去吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "大唐国境" }, { 82, "" }, { 250, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },

	{ "CA袁守城", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "角色造型转换" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1018, "" }, { 0, "" } } },
// 			{ 5, // 脚本结束
// 			{} },
// 			{ 8, // default
// 			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },

	} },

	{ "CSJW天将", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我可以送你去天宫,要去吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "天宫" }, { 236, "" }, { 16, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "CSJW西牛贺州土地", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我可以送你去大唐境外,要去吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "大唐境外" }, { 51, "" }, { 15, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "CSJW西牛贺洲土地 ", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我可以送你去大唐境外,要去吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "大唐境外" }, { 60, "" }, { 15, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "CSJW驿站老板", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我可以送你去北俱芦洲,要去吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "北俱芦洲" }, { 195, "" }, { 5, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "CS南极仙翁", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 62, "" }, { 0, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "CS服装店老板", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我这里出售40级装备,需要吗" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 24, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "CS杂货店老板", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我这里出售杂货,需要吗" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 60, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "CS武器店老板", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我这里出售40级武器,需要吗" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 4, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "CS药店老板", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我这里出售一级药材" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 40, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "CS鲁成", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我这里出售4级家具,需要吗" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 101, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "DF地遁鬼", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我可以送你去长安城,要去吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "长安城" }, { 475, "" }, { 28, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "DF白无常", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我可以送你去长安,要去吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "长安城" }, { 355, "" }, { 247, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "DF钟馗", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "地府里鬼越来越多了,时常有逃跑的鬼" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1040, "" }, { 0, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "DHW林老汉", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我可以送你去东海岩洞,要去吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "东海岩洞" }, { 15, "" }, { 10, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "DHW老虾", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我可以送你去龙宫,要去吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "龙宫" }, { 21, "" }, { 12, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "DHW船夫", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我可以送你去傲来,要去吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "傲来国" }, { 166, "" }, { 16, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "DTGJ土地", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 3, //  
			{ { 0, "土地" }, { 0, "大唐国境之内，鸟语花香山清水秀，国泰民安，乃是一颇得上天福泽庇佑的所在。少侠要去哪？" }, { 0, "凌波城" }, { 0, "赤水洲" }, { 0, "咱就来看看您" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "凌波城" }, { 14, "" }, { 67, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "赤水洲" }, { 140, "" }, { 17, "" } } },

			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "DTGJ接引仙女", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我可以送你去普驼山,要去吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "普陀山" }, { 75, "" }, { 17, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "DTGJ牢房守卫", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我可以送你进去" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "牢房" }, { 32, "" }, { 14, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "DTGJ驿站老板", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我可以送你去长安城,要去吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "长安城" }, { 273, "" }, { 39, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "DTJW南瞻部洲土地", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我可以送你去长寿郊外,要去吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "长寿郊外" }, { 90, "" }, { 15, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "DTJW南赡部州土地", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我可以送你去长寿郊外,要去吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "长寿郊外" }, { 89, "" }, { 15, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "DTJW火焰山土地", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我可以送你去墨家村,要去吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "墨家村" }, { 72, "" }, { 6, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "DTJW灵山接引僧", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我可以送你去小西天,要去吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "小西天" }, { 90, "" }, { 20, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "DTJW幻影哒哒", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我可以送你去天机城,要去吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "天机城" }, { 31, "" }, { 22, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "DTJW驿站老板", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我可以送你去朱紫国,要去吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "朱紫国" }, { 13, "" }, { 7, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "DT传送兵", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我可以送你去长安城,要去吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "长安城" }, { 475, "" }, { 28, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "FC接引道童", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我可以送你去长安城,要去吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "长安城" }, { 475, "" }, { 28, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "FC觉岸", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我这里出售变身卡,需要吗" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 99, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
// 	{ "GJ药店老板", {
// 			{ 23, // 标签 ID ~ 
// 			{ { 0, "" } } },
// 			{ 1, // NPC是否选择 描述~ 
// 			{ { 0, "我这里出售药材,需要吗" } } },
// 			{ 6, // case ~
// 			{ { 0, "" } } },
// 			{ 16, // 设置开关 哪个~  状态~
// 			{ { 1002, "" }, { 47, "" } } },
// 			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
// 			{ { 0, "" }, { 1, "" } } },
// 			{ 6, // case ~
// 			{ { 1, "" } } },
// 			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
// 			{ { 0, "" }, { 1, "" } } },
// 	} },
	{ "HGS花果山土地", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我可以送你去北俱芦洲,要去吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "北俱芦洲" }, { 195, "" }, { 105, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "HGS马猴", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我可以送你去海底迷宫,要去吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "海底迷宫一层" }, { 30, "" }, { 26, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "HS接引僧", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我可以送你去长安城,要去吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "长安城" }, { 475, "" }, { 28, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "JY兵铁铺伙计", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我这里出售0级武器,需要吗" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 0, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "JY兵铁铺老板", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我这里出售10级武器,需要吗" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "仓库管理员", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 3, // NPC是否选择 描述~ 
			{ { 0, "仓库管理员" }, { 0, "仓库存放方便队友交换资源" }, { 0, " " }, { 0, "道具仓库" }, { 0, "召唤兽仓库" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1017, "" }, { 0, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 2, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1007, "" }, { 0, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "JY服装店老板", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我这里出售0级装备,需要吗" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 20, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "JY杂货店老板", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我这里出售杂货,需要吗" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 60, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "JY海产收购商", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "收#R所有#R的大海龟/巨蛙/海毛虫" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 2001, "" }, { 0, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "JY药店老板", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我这里出售一级药材" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 40, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "JY陈长寿", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我这里可以免费治疗,需要吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1006, "" }, { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "JY飞儿", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我这里出售#R包子#R,需要吗" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 86, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "LG虾兵", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我可以送你去东海湾,要去吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "东海湾" }, { 103, "" }, { 92, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "LG龙宫传送人", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我可以送你去长安城,要去吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "长安城" }, { 475, "" }, { 28, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "MW引路小妖", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我可以送你去长安城,要去吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "长安城" }, { 475, "" }, { 28, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "NR传送女使", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我可以送你去长安城,要去吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "长安城" }, { 475, "" }, { 28, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "NR柳飞絮", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我这里出售暗器,需要吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 98, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "PS引路小妖", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我可以送你去长安城,要去吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "长安城" }, { 475, "" }, { 28, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "PT引路仙女", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我可以送你去大唐国境,要去吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "大唐国境" }, { 222, "" }, { 61, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "ST传送妖精", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我可以送你去长安城,要去吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "长安城" }, { 475, "" }, { 28, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "TG守门天将", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我可以送你去长寿郊外,要去吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "长寿郊外" }, { 20, "" }, { 55, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "TG接引仙子", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我可以送你去长安城,要去吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "长安城" }, { 475, "" }, { 28, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "WZ接引道人", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我可以送你去长安城,要去吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "长安城" }, { 475, "" }, { 28, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "XL药店老板", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我这里出售二级药材" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 41, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "XL马真人", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "召唤兽修炼" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 13, "" }, { 0, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "XL驿站老板", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我可以送你去朱紫国,要去吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "朱紫国" }, { 140, "" }, { 94, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "XXT灵山老僧", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我可以送你去大唐境外,要去吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "大唐境外" }, { 17, "" }, { 103, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "ZZ申太公", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我可以送你去#Y仙缘洞天#Y,要去吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "仙缘洞天" }, { 212, "" }, { 80, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "ZZ药店伙计", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我这里出售二级药材" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 41, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "ZZ驿站老板", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我可以送你去西梁女国,要去吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "西梁女国" }, { 15, "" }, { 11, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "卖烹饪", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我这里出售烹饪和酒,需要吗" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 46, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "帮派修炼指导师", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 2, // 双选择  谁~ 描述~ 选项1 ~ 选项2 ~
			{ { 0, "修炼指导师" }, { 0, "帮派修炼学习" }, { 0, "人物修炼" }, { 0, "召唤兽修炼" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 14, "" }, { 0, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 13, "" }, { 0, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "帮派分堂车夫", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 2, // 双选择  谁~ 描述~ 选项1 ~ 选项2 ~
			{ { 0, "帮派车夫" }, { 0, "你想去哪里" }, { 0, "长安城" }, { 0, "帮派入口" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "长安城" }, { 386, "" }, { 266, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "帮派" }, { 125, "" }, { 118, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "帮派土地公公", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 2, // 双选择  谁~ 描述~ 选项1 ~ 选项2 ~
			{ { 0, "帮派土地公公" }, { 0, "请选择要做的事" }, { 0, "帮派迷宫建设" }, { 0, "带我去药房" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "帮派药房" }, { 15, "" }, { 7, "" } } },
			{ 5, // 脚本结束
			{} },
	} },
	{ "帮派福利总管", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // 双选择  谁~ 描述~ 选项1 ~ 选项2 ~
			{ { 0, "帮派技能学习" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 12, "" }, { 0, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
// 			{ 16, // 设置开关 哪个~  状态~
// 			{ { 13, "" }, { 0, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "帮派车夫", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 4, // 四选择 谁~ 描述~ 选项1 ~ 选项2 ~ 选项3 ~ 选项4 ~
			{ { 0, "帮派车夫" }, { 0, "你想去哪里" }, { 0, "白虎堂" }, { 0, "青龙堂" }, { 0, "玄武堂" }, { 0, "朱雀堂" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "白虎堂" }, { 17, "" }, { 11, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "青龙堂" }, { 30, "" }, { 10, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 6, // case ~
			{ { 2, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "玄武堂" }, { 20, "" }, { 12, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 6, // case ~
			{ { 3, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "朱雀堂" }, { 17, "" }, { 13, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "无名野鬼", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1010, "" }, { 0, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "碗子山土地", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我可以送你去无底洞,要去吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 9, // 地图转换 地图名~ X~ Y~
			{ { 0, "无底洞" }, { 80, "" }, { 122, "" } } },
			{ 5, // 脚本结束
			{} },
			{ 8, // default
			{} },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "管家", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1000, "" }, { 0, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "装备收购商", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我这里收购装备,需要吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1004, "" }, { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "装备鉴定商", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我这里可以鉴定装备,鉴定费为#R装备价格的10%#R,需要吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1004, "" }, { 0, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "超级巫医", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我可以帮你治疗召唤兽,需要吗?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1005, "" }, { 0, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "钱庄老板", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 2, // 双选择  谁~ 描述~ 选项1 ~ 选项2 ~
			{ { 0, "钱庄老板" }, { 0, "请选择要做的事" }, { 0, "存钱" }, { 0, "取钱" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 16, "" }, { 0, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 16, "" }, { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "门派传送人", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1008, "" }, { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "门派师父", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1003, "" }, { 0, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },

	{ "跑商买卖", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "我这里出售特产" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 65, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },

#if 0
	{ "元宵专卖店", {
 			{ 23, // 标签 ID ~ 
 			{ { 0, "" } } },
// 			{ 1, // NPC是否选择 描述~ 
// 			{ { 0, "我这里出售特产" } } },
// 			{ 6, // case ~
// 			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 63, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
// 			{ 6, // case ~
// 			{ { 1, "" } } },
// 			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
// 			{ { 0, "" }, { 1, "" } } },
	} },

	{ "修炼专卖店", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 66, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },

	{ "碧藕金柳露专卖店", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 67, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },

	{ "五宝专卖店", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 68, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },

	{ "强化石专卖店", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 69, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
#endif

	{ "杂货摊位", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 70, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },

#if 0
	{ "宝宝环专卖店1", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 71, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },

	{ "宝宝环专卖店2", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 72, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },

	{ "染色专卖店", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 61, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },

	{ "合成旗专卖店", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 76, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },

	{ "变身卡专卖店47", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 47, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "变身卡专卖店48", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 48, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "变身卡专卖店49", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 49, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "变身卡专卖店50", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 50, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "变身卡专卖店51", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 51, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "变身卡专卖店52", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 52, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "变身卡专卖店53", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 53, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "变身卡专卖店54", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 54, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "变身卡专卖店55", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 55, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "变身卡专卖店56", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 56, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "变身卡专卖店57", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 57, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "变身卡专卖店58", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 58, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "变身卡专卖店59", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 59, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },

	{ "兽诀专卖店1", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 94, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "兽诀专卖店2", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 95, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "兽诀专卖店3", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 97, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },

	{ "天眼专卖店", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 73, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },

	{ "家具专卖店1", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 80, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "家具专卖店2", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 81, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "家具专卖店3", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 82, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
	{ "家具专卖店4", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 88, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },

	{ "鉴定符专卖店", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 74, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },

	{ "道具专卖店", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1002, "" }, { 75, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },
#endif



	{ "门派闯关使者", {
			{ 23, // 标签 ID ~ 
			{ { 0, "" } } },
			{ 1, // NPC是否选择 描述~ 
			{ { 0, "要开始门派闯关么?" } } },
			{ 6, // case ~
			{ { 0, "" } } },
			{ 16, // 设置开关 哪个~  状态~
			{ { 1019, "" }, { 0, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
			{ 6, // case ~
			{ { 1, "" } } },
			{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
			{ { 0, "" }, { 1, "" } } },
	} },


	{ "JY赵捕头", {
		{ 23, // 标签 ID ~ 
		{ { 0, "" } } },
		{ 3, // NPC是否选择 描述~ 
		{ { 0, "赵捕头" }, { 0, "浪时间兑换, #Y存的越久加成越多#Y" }, { 0, "换经验" }, { 0, "换大洋" }, { 0, "先留着" } } },
		{ 6, // case ~
		{ { 0, "" } } },
		{ 16, // 设置开关 哪个~  状态~
		{ { 1020, "" }, { 0, "" } } },
		{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
		{ { 0, "" }, { 1, "" } } },

		{ 6, // case ~
		{ { 1, "" } } },
		{ 16, // 设置开关 哪个~  状态~
		{ { 1020, "" }, { 1, "" } } },
		{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
		{ { 0, "" }, { 1, "" } } },

		{ 6, // case ~
		{ { 2, "" } } },
		{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
		{ { 0, "" }, { 1, "" } } },
	} },

	{ "CS马婆婆", {
		{ 23, // 标签 ID ~ 
		{ { 0, "" } } },
		{ 4, // NPC是否选择 描述~ 
		{ { 0, "马婆婆" }, { 0, "领养孩子" }, { 0, "小丫丫" }, { 0, "小仙女" }, { 0, "小精灵" }, { 0, "点错了" } } },
		{ 6, // case ~
		{ { 0, "" } } },
		{ 16, // 设置开关 哪个~  状态~
		{ { 1021, "" }, { 0, "" } } },
		{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
		{ { 0, "" }, { 1, "" } } },

		{ 6, // case ~
		{ { 1, "" } } },
		{ 16, // 设置开关 哪个~  状态~
		{ { 1021, "" }, { 1, "" } } },
		{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
		{ { 0, "" }, { 1, "" } } },

		{ 6, // case ~
		{ { 2, "" } } },
		{ 16, // 设置开关 哪个~  状态~
		{ { 1021, "" }, { 2, "" } } },
		{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
		{ { 0, "" }, { 1, "" } } },

		{ 6, // case ~
		{ { 3, "" } } },
		{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
		{ { 0, "" }, { 1, "" } } },
	} },

	{ "CS马爷爷", {
		{ 23, // 标签 ID ~ 
		{ { 0, "" } } },
		{ 4, // NPC是否选择 描述~ 
		{ { 0, "马爷爷" }, { 0, "领养孩子" }, { 0, "小毛头" }, { 0, "小仙灵" }, { 0, "小魔头" }, { 0, "点错了" } } },
		{ 6, // case ~
		{ { 0, "" } } },
		{ 16, // 设置开关 哪个~  状态~
		{ { 1022, "" }, { 0, "" } } },
		{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
		{ { 0, "" }, { 1, "" } } },

		{ 6, // case ~
		{ { 1, "" } } },
		{ 16, // 设置开关 哪个~  状态~
		{ { 1022, "" }, { 1, "" } } },
		{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
		{ { 0, "" }, { 1, "" } } },

		{ 6, // case ~
		{ { 2, "" } } },
		{ 16, // 设置开关 哪个~  状态~
		{ { 1022, "" }, { 2, "" } } },
		{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
		{ { 0, "" }, { 1, "" } } },

		{ 6, // case ~
		{ { 3, "" } } },
		{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
		{ { 0, "" }, { 1, "" } } },
	} },


	{ "江南野外江湖奸商", {
		{ 23, // 标签 ID ~ 
		{ { 0, "" } } },
		{ 1, // NPC是否选择 描述~ 
		{ { 0, "爱药不药" } } },
		{ 6, // case ~
		{ { 0, "" } } },
		{ 16, // 设置开关 哪个~  状态~
		{ { 1002, "" }, { 43, "" } } },
		{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
		{ { 0, "" }, { 1, "" } } },
		{ 6, // case ~
		{ { 1, "" } } },
		{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
		{ { 0, "" }, { 1, "" } } },
	} },

	{ "BJ江湖奸商", {
		{ 23, // 标签 ID ~ 
		{ { 0, "" } } },
		{ 1, // NPC是否选择 描述~ 
		{ { 0, "爱药不药" } } },
		{ 6, // case ~
		{ { 0, "" } } },
		{ 16, // 设置开关 哪个~  状态~
		{ { 1002, "" }, { 43, "" } } },
		{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
		{ { 0, "" }, { 1, "" } } },
		{ 6, // case ~
		{ { 1, "" } } },
		{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
		{ { 0, "" }, { 1, "" } } },
	} },

	{ "CA马副将", {
		{ 23, // 标签 ID ~ 
		{ { 0, "" } } },
		{ 0, // NPC独白~ 
		{ { 0, "经验已经无限双倍了#1" } } },
		{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
		{ { 0, "" }, { 1, "" } } },
	} },

		{ "节日奖励使者", {
		{ 23, // 标签 ID ~ 
		{ { 0, "" } } },
		{ 4, // NPC是否选择 描述~ 
		{ { 0, "节日奖励使者" }, { 0, "送你随机人兽#24" }, { 0, "人族" }, { 0, "仙族" }, { 0, "魔族" }, { 0, "我不要" } } },
		{ 6, // case ~
		{ { 0, "" } } },
		{ 16, // 设置开关 哪个~  状态~
		{ { 1024, "" }, { 183, "" } } },
		{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
		{ { 0, "" }, { 1, "" } } },

		{ 6, // case ~
		{ { 1, "" } } },
		{ 16, // 设置开关 哪个~  状态~
		{ { 1024, "" }, { 184, "" } } },
		{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
		{ { 0, "" }, { 1, "" } } },

		{ 6, // case ~
		{ { 2, "" } } },
		{ 16, // 设置开关 哪个~  状态~
		{ { 1024, "" }, { 185, "" } } },
		{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
		{ { 0, "" }, { 1, "" } } },

		{ 6, // case ~
		{ { 3, "" } } },
		{ 10, // 指针跳跃 跳到几号标签~ 向上 ~ 
		{ { 0, "" }, { 1, "" } } },
	} },
};

const map<string, vector<sScript>>& ctt::getScripts()
{
	return s_scriptMap;
}
